**Free
ctl-opt option(*srcstmt:*nodebugio) bnddir('mybnddir');

/copy myPrototype

dcl-s myTextVariable;
myTextVariable = Capitalize(myTextVariable);
